'use client'
import React from 'react'

export default function loading() {
  return (
    <div className='w-full h-[600px] bg-red-500 absolute top-0 left-50 z-50'>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
      <p>이건 로그인 라우트에서 나오는 로딩 컴포넌트입니다.</p>
    </div>
  )
}
